       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMJUEGO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 AREA-COMUNICACION.
           05 CAMPO-INCOGNITO      PIC X(4).
       01 RUTINA PIC X(8) VALUE "RUTNUMAZ".

       01 INGRESADO.
           05 PRIMERO PIC X.
           05 SEGUNDO PIC X.
           05 TERCERO PIC X.
           05 CUARTO PIC X.
       01 MASCARA PIC XXXX VALUE 'xxxx'.
       77 ACERTADOS PIC 9 VALUE 0.
       77 ERRADOS PIC 9 VALUE 4.
       77 REGULARES PIC 9 VALUE 0.

       77 INDICE PIC 9.

       01 CORTE-COMPARACION PIC X.
           88 CORTE-COMP-TRUE VALUE "S".
           88 CORTE-COMP-FALSE VALUE "N".
       01 CORTE-JUEGO PIC X.
           88 CORTE-JUEGO-TRUE VALUE "S".
           88 CORTE-JUEGO-FALSE VALUE "N".
       01 CORTE-INTENTO PIC X.
           88 CORTE-INT-TRUE VALUE "S".
           88 CORTE-INT-FALSE VALUE "N".

       77 INTENTO PIC X.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
       DISPLAY "NUMERO A ADIVINAR: " MASCARA
       INITIALIZE AREA-COMUNICACION
       CALL RUTINA USING AREA-COMUNICACION

       DISPLAY "EL NUEMERO A ADIVINAR TIENE 4 CIFRAS, TODAS DIFERENTES"
       " ENTRE SI. MUCHOS EXITOS!"

       PERFORM 100-JUGAR UNTIL CORTE-JUEGO-TRUE
       PERFORM 300-FINALIZAR.

       300-FINALIZAR.
       STOP RUN.

       100-JUGAR.
       PERFORM 110-INGRESAR-NUMERO
       PERFORM 120-COMPARAR-NUMEROS
       PERFORM 130-DEVOLVER-RESULTADOS
       MOVE "N" TO CORTE-INTENTO
       PERFORM 140-INTENTAR-DE-NUEVO UNTIL CORTE-INT-TRUE.

       110-INGRESAR-NUMERO.
       DISPLAY "INGRESE UN NUMERO DE 4 DIGITOS"
       ACCEPT INGRESADO.

       120-COMPARAR-NUMEROS.
           MOVE "N" TO CORTE-COMPARACION
           PERFORM 121-COMPARA-PRIMERO VARYING INDICE FROM 1 BY 1
           UNTIL INDICE > 4 OR CORTE-COMP-TRUE.
           MOVE "N" TO CORTE-COMPARACION
           PERFORM 122-COMPARA-SEGUNDO VARYING INDICE FROM 1 BY 1
           UNTIL INDICE > 4 OR CORTE-COMP-TRUE.
           MOVE "N" TO CORTE-COMPARACION
           PERFORM 123-COMPARA-TERCERO VARYING INDICE FROM 1 BY 1
           UNTIL INDICE > 4 OR CORTE-COMP-TRUE.
           MOVE "N" TO CORTE-COMPARACION
           PERFORM 124-COMPARA-CUARTO VARYING INDICE FROM 1 BY 1
           UNTIL INDICE > 4 OR CORTE-COMP-TRUE.

       121-COMPARA-PRIMERO.
           IF CAMPO-INCOGNITO(INDICE:1) = PRIMERO AND INDICE = 1 THEN
               ADD 1 TO ACERTADOS
               SUBTRACT 1 FROM ERRADOS
               MOVE "S" TO CORTE-COMPARACION
           ELSE
               IF CAMPO-INCOGNITO(INDICE:1) = PRIMERO THEN
                   ADD 1 TO REGULARES
                   SUBTRACT 1 FROM ERRADOS
                   MOVE "S" TO CORTE-COMPARACION
               END-IF
           END-IF.
       122-COMPARA-SEGUNDO.
           IF CAMPO-INCOGNITO(INDICE:1) = SEGUNDO AND INDICE = 2 THEN
               ADD 1 TO ACERTADOS
               SUBTRACT 1 FROM ERRADOS
               MOVE "S" TO CORTE-COMPARACION
           ELSE
               IF CAMPO-INCOGNITO(INDICE:1) = SEGUNDO THEN
                   ADD 1 TO REGULARES
                   SUBTRACT 1 FROM ERRADOS
                   MOVE "S" TO CORTE-COMPARACION
               END-IF
           END-IF.
       123-COMPARA-TERCERO.
           IF CAMPO-INCOGNITO(INDICE:1) = TERCERO AND INDICE = 3 THEN
               ADD 1 TO ACERTADOS
               SUBTRACT 1 FROM ERRADOS
               MOVE "S" TO CORTE-COMPARACION
           ELSE
               IF CAMPO-INCOGNITO(INDICE:1) = TERCERO THEN
                   ADD 1 TO REGULARES
                   SUBTRACT 1 FROM ERRADOS
                   MOVE "S" TO CORTE-COMPARACION
               END-IF
           END-IF.
       124-COMPARA-CUARTO.
           IF CAMPO-INCOGNITO(INDICE:1) = CUARTO AND INDICE = 4 THEN
               ADD 1 TO ACERTADOS
               SUBTRACT 1 FROM ERRADOS
               MOVE "S" TO CORTE-COMPARACION
           ELSE
               IF CAMPO-INCOGNITO(INDICE:1) = CUARTO THEN
                   ADD 1 TO REGULARES
                   SUBTRACT 1 FROM ERRADOS
                   MOVE "S" TO CORTE-COMPARACION
               END-IF
           END-IF.

       130-DEVOLVER-RESULTADOS.
       IF ACERTADOS = 4 THEN
           DISPLAY "FELICIDADES! HAS GANADO, ERES LO MAXIMO!"
           MOVE "S" TO CORTE-JUEGO
           PERFORM 300-FINALIZAR
       ELSE
           DISPLAY "ACERTASTE "ACERTADOS
           " NUMEROS, EN LA POSICION CORRECTA"
           DISPLAY "ACERTASTE "REGULARES
           " NUMEROS, PERO NO EN LA POSICION CORRECTA"
            DISPLAY "NO ACERTASTE "ERRADOS" NUMEROS"
       END-IF.

       140-INTENTAR-DE-NUEVO.
           DISPLAY "¿QUIERE INTENTARLO DE NUEVO? S/N"
           ACCEPT INTENTO.
           EVALUATE INTENTO
               WHEN "S"
                   INITIALIZE ACERTADOS REGULARES
                   MOVE 4 TO ERRADOS
                   MOVE "S" TO CORTE-INTENTO
               WHEN "N"
                   INITIALIZE ACERTADOS REGULARES
                   MOVE 4 TO ERRADOS
                   DISPLAY "FIN DEL JUEGO"
                   MOVE "S" TO CORTE-INTENTO
                   MOVE "S" TO CORTE-JUEGO
               WHEN OTHER
                   DISPLAY "INGRESE UNA OPCION VALIDA"
           END-EVALUATE.


       END PROGRAM PGMJUEGO.
